results/final2/oversell-output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: oversell.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 1m30s max duration (incl. graceful stop):
              * oversell: 100 iterations shared among 100 VUs (maxDuration: 1m0s, gracefulStop: 30s)


Init       [  94% ] 094/100 VUs initialized
oversell   [   0% ]

running (0m00.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell   [   0% ] 100 VUs  0m00.9s/1m0s  000/100 shared iters

running (0m01.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell   [   0% ] 100 VUs  0m01.9s/1m0s  000/100 shared iters

running (0m02.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell   [   0% ] 100 VUs  0m02.9s/1m0s  000/100 shared iters

running (0m03.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell   [   0% ] 100 VUs  0m03.9s/1m0s  000/100 shared iters

running (0m04.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell   [   0% ] 100 VUs  0m04.9s/1m0s  000/100 shared iters

running (0m05.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell   [   0% ] 100 VUs  0m05.9s/1m0s  000/100 shared iters

running (0m06.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell   [   0% ] 100 VUs  0m06.9s/1m0s  000/100 shared iters

running (0m07.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell   [   0% ] 100 VUs  0m07.9s/1m0s  000/100 shared iters

running (0m08.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell   [   0% ] 100 VUs  0m08.9s/1m0s  000/100 shared iters

running (0m09.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell   [   0% ] 100 VUs  0m09.9s/1m0s  000/100 shared iters

running (0m10.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell   [   0% ] 100 VUs  0m10.9s/1m0s  000/100 shared iters

running (0m11.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell   [   0% ] 100 VUs  0m11.9s/1m0s  000/100 shared iters

running (0m12.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell   [   0% ] 100 VUs  0m12.9s/1m0s  000/100 shared iters

running (0m13.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell   [   0% ] 100 VUs  0m13.9s/1m0s  000/100 shared iters

running (0m14.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell   [   0% ] 100 VUs  0m14.9s/1m0s  000/100 shared iters

running (0m15.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell   [   0% ] 100 VUs  0m15.9s/1m0s  000/100 shared iters

running (0m16.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell   [   0% ] 100 VUs  0m16.9s/1m0s  000/100 shared iters

running (0m17.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell   [   0% ] 100 VUs  0m17.9s/1m0s  000/100 shared iters

running (0m18.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell   [   0% ] 100 VUs  0m18.9s/1m0s  000/100 shared iters

running (0m19.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell   [   0% ] 100 VUs  0m19.9s/1m0s  000/100 shared iters

running (0m20.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell   [   0% ] 100 VUs  0m20.9s/1m0s  000/100 shared iters

running (0m21.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell   [   0% ] 100 VUs  0m21.9s/1m0s  000/100 shared iters

running (0m22.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell   [   0% ] 100 VUs  0m22.9s/1m0s  000/100 shared iters

running (0m23.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell   [   0% ] 100 VUs  0m23.9s/1m0s  000/100 shared iters

running (0m24.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell   [   0% ] 100 VUs  0m24.9s/1m0s  000/100 shared iters

running (0m25.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell   [   0% ] 100 VUs  0m25.9s/1m0s  000/100 shared iters

running (0m26.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell   [   0% ] 100 VUs  0m26.9s/1m0s  000/100 shared iters

running (0m27.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell   [   0% ] 100 VUs  0m27.9s/1m0s  000/100 shared iters

running (0m28.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell   [   0% ] 100 VUs  0m28.9s/1m0s  000/100 shared iters

running (0m29.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell   [   0% ] 100 VUs  0m29.9s/1m0s  000/100 shared iters

running (0m30.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell   [   0% ] 100 VUs  0m30.9s/1m0s  000/100 shared iters

running (0m31.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell   [   0% ] 100 VUs  0m31.9s/1m0s  000/100 shared iters

running (0m32.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell   [   0% ] 100 VUs  0m32.9s/1m0s  000/100 shared iters

running (0m33.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell   [   0% ] 100 VUs  0m33.9s/1m0s  000/100 shared iters

running (0m34.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell   [   0% ] 100 VUs  0m34.9s/1m0s  000/100 shared iters

running (0m35.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell   [   0% ] 100 VUs  0m35.9s/1m0s  000/100 shared iters

running (0m36.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell   [   0% ] 100 VUs  0m36.9s/1m0s  000/100 shared iters

running (0m37.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell   [   0% ] 100 VUs  0m37.9s/1m0s  000/100 shared iters

running (0m38.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell   [   0% ] 100 VUs  0m38.9s/1m0s  000/100 shared iters

running (0m39.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell   [   0% ] 100 VUs  0m39.9s/1m0s  000/100 shared iters

running (0m40.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell   [   0% ] 100 VUs  0m40.9s/1m0s  000/100 shared iters

running (0m41.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell   [   0% ] 100 VUs  0m41.9s/1m0s  000/100 shared iters

running (0m42.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell   [   0% ] 100 VUs  0m42.9s/1m0s  000/100 shared iters

running (0m43.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell   [   0% ] 100 VUs  0m43.9s/1m0s  000/100 shared iters

running (0m44.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell   [   0% ] 100 VUs  0m44.9s/1m0s  000/100 shared iters

running (0m45.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell   [   0% ] 100 VUs  0m45.9s/1m0s  000/100 shared iters

running (0m46.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell   [   0% ] 100 VUs  0m46.9s/1m0s  000/100 shared iters

running (0m47.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell   [   0% ] 100 VUs  0m47.9s/1m0s  000/100 shared iters

running (0m48.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell   [   0% ] 100 VUs  0m48.9s/1m0s  000/100 shared iters

running (0m49.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell   [   0% ] 100 VUs  0m49.9s/1m0s  000/100 shared iters

running (0m50.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell   [   0% ] 100 VUs  0m50.9s/1m0s  000/100 shared iters

running (0m51.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell   [   0% ] 100 VUs  0m51.9s/1m0s  000/100 shared iters

running (0m52.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell   [   0% ] 100 VUs  0m52.9s/1m0s  000/100 shared iters

running (0m53.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell   [   0% ] 100 VUs  0m53.9s/1m0s  000/100 shared iters

running (0m54.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell   [   0% ] 100 VUs  0m54.9s/1m0s  000/100 shared iters

running (0m55.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell   [   0% ] 100 VUs  0m55.9s/1m0s  000/100 shared iters

running (0m56.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell   [   0% ] 100 VUs  0m56.9s/1m0s  000/100 shared iters

running (0m57.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell   [   0% ] 100 VUs  0m57.9s/1m0s  000/100 shared iters

running (0m58.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell   [   0% ] 100 VUs  0m58.9s/1m0s  000/100 shared iters

running (0m59.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell   [   0% ] 100 VUs  0m59.9s/1m0s  000/100 shared iters
time="2026-07-14T17:49:45+05:30" level=warning msg="Request Failed" error="Get \"http://localhost:9020/store/products?limit=20&region_id=reg_01KXFJD3Y7EX4MG3SA0MS2ZCQ8\": request timeout"
time="2026-07-14T17:49:45+05:30" level=warning msg="Request Failed" error="Get \"http://localhost:9020/store/products?limit=20&region_id=reg_01KXFJD3Y7EX4MG3SA0MS2ZCQ8\": request timeout"
time="2026-07-14T17:49:45+05:30" level=warning msg="Request Failed" error="Get \"http://localhost:9020/store/products?limit=20&region_id=reg_01KXFJD3Y7EX4MG3SA0MS2ZCQ8\": request timeout"
[...]

running (1m00.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell ↓ [   0% ] 100 VUs  1m00.0s/1m0s  000/100 shared iters

running (1m01.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell ↓ [   0% ] 100 VUs  1m00.0s/1m0s  000/100 shared iters

running (1m02.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell ↓ [   0% ] 100 VUs  1m00.0s/1m0s  000/100 shared iters

running (1m03.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell ↓ [   0% ] 100 VUs  1m00.0s/1m0s  000/100 shared iters

running (1m04.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
oversell ↓ [   0% ] 100 VUs  1m00.0s/1m0s  000/100 shared iters
time="2026-07-14T17:49:50+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:9020/store/carts\": request timeout"

running (1m05.9s), 099/100 VUs, 1 complete and 0 interrupted iterations
oversell ↓ [   0% ] 100 VUs  1m00.0s/1m0s  000/100 shared iters

running (1m06.9s), 099/100 VUs, 1 complete and 0 interrupted iterations
oversell ↓ [   0% ] 100 VUs  1m00.0s/1m0s  000/100 shared iters

running (1m07.9s), 099/100 VUs, 1 complete and 0 interrupted iterations
oversell ↓ [   0% ] 100 VUs  1m00.0s/1m0s  000/100 shared iters

running (1m08.9s), 099/100 VUs, 1 complete and 0 interrupted iterations
oversell ↓ [   0% ] 100 VUs  1m00.0s/1m0s  000/100 shared iters

running (1m09.9s), 099/100 VUs, 1 complete and 0 interrupted iterations
oversell ↓ [   0% ] 100 VUs  1m00.0s/1m0s  000/100 shared iters

running (1m10.9s), 099/100 VUs, 1 complete and 0 interrupted iterations
oversell ↓ [   0% ] 100 VUs  1m00.0s/1m0s  000/100 shared iters

running (1m11.9s), 099/100 VUs, 1 complete and 0 interrupted iterations
oversell ↓ [   0% ] 100 VUs  1m00.0s/1m0s  000/100 shared iters

running (1m12.9s), 099/100 VUs, 1 complete and 0 interrupted iterations
oversell ↓ [   0% ] 100 VUs  1m00.0s/1m0s  000/100 shared iters

running (1m13.9s), 099/100 VUs, 1 complete and 0 interrupted iterations
oversell ↓ [   0% ] 100 VUs  1m00.0s/1m0s  000/100 shared iters

running (1m14.9s), 099/100 VUs, 1 complete and 0 interrupted iterations
oversell ↓ [   0% ] 100 VUs  1m00.0s/1m0s  000/100 shared iters

running (1m15.9s), 099/100 VUs, 1 complete and 0 interrupted iterations
oversell ↓ [   0% ] 100 VUs  1m00.0s/1m0s  000/100 shared iters

running (1m16.9s), 099/100 VUs, 1 complete and 0 interrupted iterations
oversell ↓ [   0% ] 100 VUs  1m00.0s/1m0s  000/100 shared iters

running (1m17.9s), 099/100 VUs, 1 complete and 0 interrupted iterations
oversell ↓ [   0% ] 100 VUs  1m00.0s/1m0s  000/100 shared iters

running (1m18.9s), 099/100 VUs, 1 complete and 0 interrupted iterations
oversell ↓ [   0% ] 100 VUs  1m00.0s/1m0s  000/100 shared iters

running (1m19.9s), 099/100 VUs, 1 complete and 0 interrupted iterations
oversell ↓ [   0% ] 100 VUs  1m00.0s/1m0s  000/100 shared iters

running (1m20.9s), 099/100 VUs, 1 complete and 0 interrupted iterations
oversell ↓ [   0% ] 100 VUs  1m00.0s/1m0s  000/100 shared iters

running (1m21.9s), 099/100 VUs, 1 complete and 0 interrupted iterations
oversell ↓ [   0% ] 100 VUs  1m00.0s/1m0s  000/100 shared iters

running (1m22.9s), 099/100 VUs, 1 complete and 0 interrupted iterations
oversell ↓ [   0% ] 100 VUs  1m00.0s/1m0s  000/100 shared iters

running (1m23.9s), 099/100 VUs, 1 complete and 0 interrupted iterations
oversell ↓ [   0% ] 100 VUs  1m00.0s/1m0s  000/100 shared iters

running (1m24.9s), 099/100 VUs, 1 complete and 0 interrupted iterations
oversell ↓ [   0% ] 100 VUs  1m00.0s/1m0s  000/100 shared iters

running (1m25.9s), 099/100 VUs, 1 complete and 0 interrupted iterations
oversell ↓ [   0% ] 100 VUs  1m00.0s/1m0s  000/100 shared iters

running (1m26.9s), 099/100 VUs, 1 complete and 0 interrupted iterations
oversell ↓ [   0% ] 100 VUs  1m00.0s/1m0s  000/100 shared iters

running (1m27.9s), 099/100 VUs, 1 complete and 0 interrupted iterations
oversell ↓ [   0% ] 100 VUs  1m00.0s/1m0s  000/100 shared iters

running (1m28.9s), 099/100 VUs, 1 complete and 0 interrupted iterations
oversell ↓ [   0% ] 100 VUs  1m00.0s/1m0s  000/100 shared iters

running (1m29.9s), 099/100 VUs, 1 complete and 0 interrupted iterations
oversell ↓ [   0% ] 100 VUs  1m00.0s/1m0s  000/100 shared iters


  █ TOTAL RESULTS 

    checks_total.......: 101     1.119743/s
    checks_succeeded...: 0.00%   0 out of 101
    checks_failed......: 100.00% 101 out of 101

    ✗ list products 200
      ↳  0% — ✓ 0 / ✗ 100
    ✗ create cart 200
      ↳  0% — ✓ 0 / ✗ 1

    HTTP
    http_req_duration....: avg=59.24s min=4.54s med=59.82s max=1m0s p(90)=59.93s p(95)=59.96s
    http_req_failed......: 100.00% 101 out of 101
    http_reqs............: 101     1.119743/s

    EXECUTION
    iteration_duration...: avg=1m4s   min=1m4s  med=1m4s   max=1m4s p(90)=1m4s   p(95)=1m4s  
    iterations...........: 1       0.011087/s
    vus..................: 99      min=0                max=100
    vus_max..............: 100     min=94               max=100

    NETWORK
    data_received........: 145 B   1.60755157574517 B/s
    data_sent............: 58 kB   644 B/s



running (1m30.2s), 000/100 VUs, 1 complete and 99 interrupted iterations
oversell ✗ [   1% ] 100 VUs  1m30.0s/1m0s  001/100 shared iters